# Написать программу, которая определяет, является ли год високосным
#================================================================
vvod_god = input('Введите целое четырехзначное число: ')
god = int(vvod_god)
#
if god % 400 == 0:
    print("да")
elif (god % 4 == 0 and god % 100!=0):
        print("да")
else:
        print("нет")
#================================================================        
# C:\Users\Dina>python "D:\!   ___ОБУЧЕНИЕ DS\_ЗАДАНИЯ_DS\2.3.py"
# Введите целое четырехзначное число: 2020
# да
# 
# C:\Users\Dina>python "D:\!   ___ОБУЧЕНИЕ DS\_ЗАДАНИЯ_DS\2.3.py"
# Введите целое четырехзначное число: 2021
# нет
