name=input('Введите имя: ')
surname=input('Введите фамилию: ')
god = input('Введите год рождения: ')
vozr=2024-int(god)
# ИСПРАВИТЬ: вывод не соответствует требуемому формату (лишний пробел)
print(surname,name,",",vozr)
# КОММЕНТАРИЙ: в случае, если вы будете генерировать строку не для чтения человеком, а для другой функции/класса/программы — неверный формат может стоить вам неработающего приложения


# C:\Users\Dina>python "D:\!   ___ОБУЧЕНИЕ DS\_ЗАДАНИЯ_DS\Задание 1\1.py"
# Введите имя: Дина
# Введите фамилию: Еремина
# Введите год рождения: 1968
# Еремина Дина , 56


# ИТОГ: доработать — 1/2

