chislo=input('Введите целое число: ')
chislo_sled=int(chislo)+1
# ИСПРАВИТЬ: повторное вычисление одного и того же объекта неоптимально
chislo_pred=int(chislo)-1
# ИСПРАВИТЬ: вывод не соответствует требуемому формату (не хватает пробела)
print("Следующее за числом ",chislo," число: ",chislo_sled,'\n',"Для числа ",chislo," предыдущее число: ",chislo_pred,sep='')


# C:\Users\Dina>python "D:\!   ___ОБУЧЕНИЕ DS\_ЗАДАНИЯ_DS\Задание 1\2.py"
# Введите целое число: 20
# Следующее за числом 20 число: 21
# Для числа 20 предыдущее число: 19


# ИТОГ: доработать — 2/3

