# !!!!ГЕННАДИЙ ДМИТРИЕВИЧ !!!!!!_______прошу об обратной связи:
# что не так определила, т.к. просто вызов из интерпретатора функции дает ошибку, а с помощтю utils работает
# 
#>>> important_message(user_input)
# Traceback (most recent call last):
  # File "<stdin>", line 1, in <module>
# NameError: name 'important_message' is not defined

def main():
    global user_input
    user_input = str(input('Введите текст объявления:          '))
import utils

#==================================================================================
# C:\Users\Dina\GIT_LOK_Eremina>python -i "C:\Users\Dina\GIT_LOK_Eremina\2024.11.30\2.py"
# >>> main()
# Введите текст объявления:          ЗАГОЛОВОК ПРОГРАММЫ
# >>> utils.important_message(user_input)
#=======================================================================================================================#
#                                                                                                                       #
#                                                  ЗАГОЛОВОК ПРОГРАММЫ                                                  #
#                                                                                                                       #
#=======================================================================================================================#
# >>> user_input = 'Обратите внимание на очень важное сообщение от команды разработчиков этой великолепной и замечательной чудо программы'
# >>> utils.important_message(user_input)
#=======================================================================================================================#
#                                                                                                                       #
#      Обратите внимание на очень важное сообщение от команды разработчиков этой великолепной и замечательной чудо      #
#                                                       программы                                                       #
#                                                                                                                       #
#=======================================================================================================================#