# Написать программу, которая подсчитывает стоимость отправки телеграммы
kolvo = len(str(input('Введите текст телеграммы          ')).replace(" ", ""))
cena_kop = kolvo * 30
if cena_kop < 100:
    print("0 руб. ", cena_kop, "коп.")
else:
    print(cena_kop // 100, "руб.", cena_kop % 100, "коп.")
#============================================================
# C:\Users\Dina\GIT_LOK_Eremina>python "C:\Users\Dina\GIT_LOK_Eremina\2024.11.03\5.py"
# Введите текст телеграммы          грузите апельсины бочках братья карамазовы
# 11 руб. 40 коп.