# Написать программу, которая подсчитывает количество очков за слово в настольной игре "Эрудит"
# ----------------------------------- данныe по очкам за букву из условия задачи ---------------------
scores_letters = {
    1: 'АВЕИНОРСТ',
    2: 'ДКЛМПУ',
    3: 'БГЬЯ',
    4: 'ЙЫ',
    5: 'ЖЗХЦЧ',
    8: 'ФШЭЮ',
    10: 'Щ',
    15: 'Ъ'
}
# ----------------------------------- конец данных по очкам за букву   --------------------------------
text_vvod = str(input('Введите введите слово:          '))
lst = []  # формируем из букв слова список букв
for i in range(len(text_vvod)):
    lst.append(text_vvod[i].upper())
# -----------------------------------конец ввода данных пользователем ------------------------------
dict_well = {}
for key, value in scores_letters.items():
    dict1 = dict.fromkeys(list(str(value)), key)
    dict_well.update(dict1) # улучшенный словарь, в котором ключ - это буква, а значение - ее баллы
sumD = 0 # сумма очков
for i in lst:
    for key, value in dict_well.items():
        if key == str(i):
            sumD = sumD + int(value)
            break
print(sumD)
   
# ----------------- улучшенный словарь, в котором ключ - это буква, а значение - ее баллы--------
# {'А': 1, 'В': 1, 'Е': 1, 'И': 1, 'Н': 1, 'О': 1, 'Р': 1, 'С': 1, 'Т': 1, 
#  'Д': 2, 'К': 2, 'Л': 2, 'М': 2, 'П': 2, 'У': 2, 
#  'Б': 3, 'Г': 3, 'Ь': 3, 'Я': 3, 
#  'Й': 4, 'Ы': 4, 
#  'Ж': 5, 'З': 5, 'Х': 5, 'Ц': 5, 'Ч': 5, 
#  'Ф': 8, 'Ш': 8, 'Э': 8, 'Ю': 8, 
#  'Щ': 10, 
#  'Ъ': 15}
#=================================================================================================        
# C:\Users\Dina\GIT_LOK_Eremina>python "C:\Users\Dina\GIT_LOK_Eremina\2024.11.09\5.py"
# Введите введите слово:          дисквалификация
# 32

# C:\Users\Dina\GIT_LOK_Eremina>python "C:\Users\Dina\GIT_LOK_Eremina\2024.11.09\5.py"
# Введите введите слово:          синхрофазотрон
# 29

# C:\Users\Dina\GIT_LOK_Eremina>python "C:\Users\Dina\GIT_LOK_Eremina\2024.11.09\5.py"
# Введите введите слово:          Гидразинокарбонилметилбромфенилдигидробенздиазепин
# 90